---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.Dispose
source: html/cac42c39-1514-7369-7b18-caa595a47d02.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.Dispose Method

Releases all resources used by the ConduitSizeSettingIterator

## Syntax (C#)
```csharp
public void Dispose()
```